/**
 * Controller for processing a news list
 */
(function () {
    "use strict";

    angular
        .module('app')
        .controller('News', News);

    News.$inject = ['$rootScope', '$state'];

    function News($rootScope, $state) {
        var vm = this;
        vm.list = [
            {
                img: 'img/cm_5Wvf1VuE.jpg',
                header: 'Новітня технологія збору пшениці',
                text: 'За морфологічними особливостями види пшениці об\'єднують у дві групи: пшениці справжні, або голозерні і полб\'яні, або плівчасті. Плівчасті, на відміну від голозерних, утворюють ламкий колос, який у достиглому стані при легкому надавлюванні ламається на окремі колоски з зерном разом із члениками стрижня. При обмолочуванні голозерних пшениць у бункер комбайна надходить зерно без лусок.'
            },
            {
                img: 'img/cm_5Wvf1VuE.jpg',
                header: 'Новітня технологія збору пшениці',
                text: 'За морфологічними особливостями види пшениці об\'єднують у дві групи: пшениці справжні, або голозерні і полб\'яні, або плівчасті. Плівчасті, на відміну від голозерних, утворюють ламкий колос, який у достиглому стані при легкому надавлюванні ламається на окремі колоски з зерном разом із члениками стрижня. При обмолочуванні голозерних пшениць у бункер комбайна надходить зерно без лусок.'
            },
            {
                img: 'img/cm_5Wvf1VuE.jpg',
                header: 'Новітня технологія збору пшениці',
                text: 'За морфологічними особливостями види пшениці об\'єднують у дві групи: пшениці справжні, або голозерні і полб\'яні, або плівчасті. Плівчасті, на відміну від голозерних, утворюють ламкий колос, який у достиглому стані при легкому надавлюванні ламається на окремі колоски з зерном разом із члениками стрижня. При обмолочуванні голозерних пшениць у бункер комбайна надходить зерно без лусок.'
            }
        ];
    }
})();
